import {
  Center,
  Flex,
  HStack,
  Image,
  SimpleGrid,
  Text,
  List,
  ListItem,
  ListIcon,
  OrderedList,
  UnorderedList,
  VStack,
} from "@chakra-ui/react";

import { BlockTitle, Line } from "~/components/common";

const OurChallengePage = () => {
  return (
    <Center
      w="full"
      display="flex"
      flexDirection="column"
      py="20px"
      bgColor="palette.container"
      px={{ base: 8, md: 16 }}
    >
      <Center>
        <VStack>
          <Text
            fontSize="20px"
            mt={2}
            color="black"
            w="100%"
            textAlign="left"
            textIndent="50px"
            lineHeight="9"
          >
            <b>“Redesigning the Court for People-Centered Justice”</b>{" "}
            คือโจทย์สำคัญที่ผู้เข้าร่วมหลักสูตรต้องช่วยกันระดมความคิดเพื่อแก้ปัญหากระบวนการชั้นศาลในปัจจุบัน
            ทั้งนี้ เนื่องจากกระบวนการชั้นศาลที่ผ่านมามักถูกกำหนดกระบวนการทำงาน
            การให้บริหาร หรือองค์ประกอบอื่น ๆ
            จากมุมมองของบุคลากรภายในศาลเป็นสำคัญ (Institution-Centered)
            อย่างไรก็ตาม
            ผู้ใช้บริการศาลซึ่งเป็นหัวใจของการให้บริการศาลกลับสะท้อนประสบการณ์ในทำนองที่ว่า
            กระบวนการทำงานต่าง ๆ
            ภายในศาลไม่สามารถตอบสนองต่อความต้องการของประชาชน
            เพราะผู้กำหนดกระบวนการไม่ได้มองจากมุมมองของผู้ใช้บริการ ดังนั้น
            กระบวนการยุติธรรมทั่วโลกจึงหันมาให้ความสำคัญกับการออกแบบกระบวนการทำงานและองค์ประกอบอื่น
            ๆ ของศาลเสียใหม่ โดยออกแบบผ่านแว่นตา หรือประสบการณ์ของผู้ใช้บริการ
            (User experience)
            อันเป็นที่มาของกระบวนการยุติธรรมที่ยึดเอาความต้องการของประชาชนเป็นศูนย์กลาง
            (People-Centered Justice)
          </Text>
          <br />

          <Text
            fontSize="20px"
            mt={2}
            color="black"
            w="100%"
            textAlign="left"
            textIndent="50px"
            lineHeight="9"
          >
            ดังนั้น การกำหนดกระบวนการทำงาน การให้บริการ หรือองค์ประกอบอื่น ๆ
            ของศาลในยุคใหม่จึง{" "}
            <b>
              “จำเป็นต้องคำนึงถึงผู้ใช้บริการทุกกลุ่ม
              รวมถึงประสบการณ์ที่ผู้ใช้บริการศาลแต่ละกลุ่มจะได้รับในการมาใช้บริการศาลตั้งแต่ต้นจนจบ”
            </b>{" "}
            กระบวนการ เช่น กลุ่มประชาชนผู้สูงอายุ
            กลุ่มประชาชนที่มีฐานะยากจนไม่มีเงินจ้างทนายความ
            กลุ่มประชาชนที่ต้องทำงานประจำจนไม่มีเวลาแต่มีความจำเป็นต้องใช้บริการศาล
            กลุ่มประชาชนที่ไม่สามารถเข้าถึงเทคโนโลยีแต่ต้องใช้บริการศาลในยุคดิจิทัล
            หรือประเด็นอื่น ๆ
            เพื่อให้บริการของศาลยุติธรรมสามารถตอบโจทย์ความต้องการของประชาชนให้ได้มากที่สุด
          </Text>
        </VStack>
      </Center>

      {/* <ClientPanel /> */}
    </Center>
  );
};

export default OurChallengePage;
